import pytest
import io
from D.main_tle import main

@pytest.mark.parametrize("input_data, expected_output", [
    (
        # 入力
        """5 4
16 9 2 3 1
6 10
12 4
1 1
1000000000 1000000000
""",
        
        # 期待される出力
        """17
15
4
1999999999
"""
    ),



    (
        # 入力
        """10 10
284008711 658403910 982178205 50598815 694147827 230009803 763277509 509451676 821970166 284008710
740250292 159734720
255870361 8400028
23659634 718117163
697334729 301140741
698853172 270344164
713418715 285312509
50065000 52368934
46642556 591869945
607623561 273664826
482426028 265015448
""",

        # 期待される出力
        """899985013
264270388
741776803
998475472
969197337
998731226
102433934
638512505
881288390
747441478
"""
    ),



    (
        # 入力
        """""",

        # 期待される出力
        """"""
    ),



    (
        # 入力
        """""",

        # 期待される出力
        """"""
    ),



    (
        # 入力
        """""",

        # 期待される出力
        """"""
    ),


])

def test_main(monkeypatch, capsys, input_data, expected_output):
    monkeypatch.setattr('sys.stdin', io.StringIO(input_data))
    main()
    captured = capsys.readouterr()

    # 両方の末尾の改行や空白を削ぎ落としてから比較する
    assert captured.out.strip() == expected_output.strip()